/*Данная база данных представляет собой упрощённую модель интернет магазина одежд

В данном магазине можно зарегистрироваться и создать свой профиль
Есть каталог с разделами для женщин, для мужчин и для детей 
В каждом разделе есть под каталог одежда, обувь, бельё, аксессуары и.т.д.
В каждом разделе есть под раздел товаров т.е. вариантов одежды: штаны, кофты, юбки и.т.д
На каждый товар действует скидка в день рождения пользователя
Пользователи могут оставить отзыв о товаре 
Пользователь по интересным вопросом могут обратится менеджеру и также по вопросам доставки.
Пользователь может выбрать вариант доставки товара.

БД решает следующие задачи
- выводи количество заказанных товара у каждого пользователя
- выводит все категории заказа конкретного пользователя
- Определяет кто больше совершает заказов (всего): мужчины или женщины
- выводит список всех товаров в разделе для женщин
- Определяет кто больше оставил отзывов о товаре (мужчины или женщины)
- выводит кто сколько написал сообщений менеджеру
- выводит Все товары чья цена ниже среднего
- выводит сколько в каждом месяце было сделано заказов*/
